README.md
```mermaid
sequenceDiagram
Script->> Broker: Give me the IDs of all requests with this tag
Broker--x Script: Here you go
Script->> Script: Let's compare them with what I have written down
Script->> Broker: Some IDs are new, get me the results
Broker--x Script: Alright
Script->> FTP: I have new results for you
FTP--x Script: Good
Script->> Script: Better write down, what results I just gave him
```
